In [1]:
# Import relevant libraries
from splinter import Browser
from bs4 import BeautifulSoup as soup
from webdriver_manager.chrome import ChromeDriverManager
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
executable_path = {'executable_path': ChromeDriverManager().install()}
browser = Browser('chrome', **executable_path, headless=False)

In [8]:
# Visit the website
url = 'https://data-class-mars-challenge.s3.amazonaws.com/Mars/index.html'
browser.visit(url)

html = browser.html
html_soup = soup(html, 'html.parser')

In [14]:
table = html_soup.find('table', class_='table')

In [16]:
df = pd.read_html('https://data-class-mars-challenge.s3.amazonaws.com/Mars/index.html')
df

[        id terrestrial_date   sol   ls  month  min_temp  pressure
 0        2       2012-08-16    10  155      6     -75.0     739.0
 1       13       2012-08-17    11  156      6     -76.0     740.0
 2       24       2012-08-18    12  156      6     -76.0     741.0
 3       35       2012-08-19    13  157      6     -74.0     732.0
 4       46       2012-08-20    14  157      6     -74.0     740.0
 ...    ...              ...   ...  ...    ...       ...       ...
 1862  1889       2018-02-23  1973  133      5     -78.0     730.0
 1863  1892       2018-02-24  1974  134      5     -77.0     729.0
 1864  1894       2018-02-25  1975  134      5     -76.0     729.0
 1865  1893       2018-02-26  1976  135      5     -77.0     728.0
 1866  1895       2018-02-27  1977  135      5     -77.0     727.0

 [1867 rows x 7 columns]]

In [19]:
mars_df = df[0]
mars_df

        id terrestrial_date   sol   ls  month  min_temp  pressure
0        2       2012-08-16    10  155      6     -75.0     739.0
1       13       2012-08-17    11  156      6     -76.0     740.0
2       24       2012-08-18    12  156      6     -76.0     741.0
3       35       2012-08-19    13  157      6     -74.0     732.0
4       46       2012-08-20    14  157      6     -74.0     740.0
...    ...              ...   ...  ...    ...       ...       ...
1862  1889       2018-02-23  1973  133      5     -78.0     730.0
1863  1892       2018-02-24  1974  134      5     -77.0     729.0
1864  1894       2018-02-25  1975  134      5     -76.0     729.0
1865  1893       2018-02-26  1976  135      5     -77.0     728.0
1866  1895       2018-02-27  1977  135      5     -77.0     727.0

[1867 rows x 7 columns]

In [20]:
mars_df.columns=['id', 'terrestrial_date', 'sol', 'ls', 'month', 'mimn_temp', 'pressure']

In [21]:
mars_df

        id terrestrial_date   sol   ls  month  mimn_temp  pressure
0        2       2012-08-16    10  155      6      -75.0     739.0
1       13       2012-08-17    11  156      6      -76.0     740.0
2       24       2012-08-18    12  156      6      -76.0     741.0
3       35       2012-08-19    13  157      6      -74.0     732.0
4       46       2012-08-20    14  157      6      -74.0     740.0
...    ...              ...   ...  ...    ...        ...       ...
1862  1889       2018-02-23  1973  133      5      -78.0     730.0
1863  1892       2018-02-24  1974  134      5      -77.0     729.0
1864  1894       2018-02-25  1975  134      5      -76.0     729.0
1865  1893       2018-02-26  1976  135      5      -77.0     728.0
1866  1895       2018-02-27  1977  135      5      -77.0     727.0

[1867 rows x 7 columns]

In [23]:
mars_df.to_csv('mars_data.csv')